tests/auto_build/testcases/output/Attachment1Request.out

POST /axis/Attachment1 HTTP/1.1
Host: localhost:13260
SOAPAction: ""
Content-Type: multipart/related; type="text/xml"; boundary="------=MIME_BOUNDARY"; start="<8>"
Content-Length: 2036


--------=MIME_BOUNDARY
Content-Type: text/xml; charset=UTF-8
Content-Transfer-Encoding: binary
Content-Id: <8>

<?xml version='1.0' encoding='utf-8' ?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
<SOAP-ENV:Body>
<ns1:put xmlns:ns1="http://attachment1">
<ns1:arg1 href="cid:1"
   xsi:type="ns2:Image"
   xmlns:ns2="http://xml.apache.org/xml-soap"/>
<ns1:arg2 href="cid:2"
   xsi:type="ns2:PlainText"
   xmlns:ns2="http://xml.apache.org/xml-soap"/>
<ns1:arg3 href="cid:3"
   xsi:type="ns2:Source"
   xmlns:ns2="http://xml.apache.org/xml-soap"/>
<ns1:arg4 href="cid:4"
   xsi:type="ns2:octet-stream"
   xmlns:ns2="http://xml.apache.org/xml-soap"/>
<ns1:arg5 href="cid:5"
   xsi:type="ns2:DataHandler"
   xmlns:ns2="http://xml.apache.org/xml-soap"/>
<ns1:arg7 href="cid:6"
   xsi:type="ns2:DataHandler"
   xmlns:ns2="http://xml.apache.org/xml-soap"/>
<ns1:arg8 xsi:nil="true"
   xsi:type="ns2:DataHandler"
   xmlns:ns2="http://xml.apache.org/xml-soap"/>
</ns1:put>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>


--------=MIME_BOUNDARY
Content-Id: <1>
Content-Type: text/plain
Content-Transfer-Encoding: base64

U29tZSBhdHRhY2htZW50IHRleHQA

--------=MIME_BOUNDARY
Content-Id: <2>
Content-Type: image/jpeg
Content-Transfer-Encoding: base64

U29tZSBhdHRhY2htZW50IHRleHQA

--------=MIME_BOUNDARY
Content-Id: <3>
Content-Type: text/plain
Content-Transfer-Encoding: base64
Content-Disposition: checked

U29tZSBhdHRhY2htZW50IHRleHQA

--------=MIME_BOUNDARY
Content-Id: <4>
Content-Type: text/plain
Content-Transfer-Encoding: base64

U29tZSBhdHRhY2htZW50IHRleHQA

--------=MIME_BOUNDARY
Content-Id: <5>
Content-Type: text/plain
Content-Transfer-Encoding: base64

U29tZSBhdHRhY2htZW50IHRleHQA

--------=MIME_BOUNDARY
Content-Id: <6>
Content-Type: text/plain
Content-Transfer-Encoding: base64

U29tZSBhdHRhY2htZW50IHRleHQA

--------=MIME_BOUNDARY--
